<html lang="en">
<head>
    <title>ESA 3: Kellerautomat</title>
</head>
<link rel="stylesheet" href="./css/main.css">

<body>
<div class="docs">
    <h1>Dokumentation</h1>
    <h2>Aufgabenstellung</h2>
    <p>Pr&uuml;fen eines mit Hilfe der L&ouml;sung von ESA 2 erstellten Grammatik mit einem Kellerautomat.</p>

    <h2>Technische Umsetzung</h2>
    <p>Das Layout wurde grunds&auml;tzlich mit HTML5 und CSS3 erstellt.<br>
        Es handelt sich um eine Grid-View, in dem die einzelnen Bereiche aufgeteilt sind. <br>
        Das Design der Buttons und Textfelder wurde mit Bootstrap generiert.<br>
        S&auml;mtliche Funktionalit&auml;t wurde mit JavaScript implementiert.</p>
    <p>Bei dem Graph handel es sich um ein SVG, das mit Adobe Illustrator erstellt wurde.</p>

    <h2>Fachliche Umsetzung</h2>
    <p>Der Automat pr&uuml;ft Zeichen f&uuml;r Zeicchen die eingegebene Grammtik. <br>
        Als Startwert wird immer eine Ziffer oder eine "(" erwartet. Ist dies nicht der Fall, wird false zur&uuml;ck gegeben.<br>
        Bei Zeichen, die nicht an der ersten Stelle befinden, wird zus&auml;tzlich der Vorg&auml;nger &uuml;berpr&uuml;ft.</p>
    <p>Ge&ouml;ffnete Klammern werden mit 'X' in den Keller geschrieben. Wird eine Klammer geschlossen, wird ein 'X' aus dem Keller geholt.</p>
    <p>Beispiel geschlossene Klammer: <br>
        <br>
        Es wird in Zeile 312 folgendes &uuml;berpr&uuml;ft:<br>
        <br>
        <i>if (isClosed(current_char) && (isClosed(last_char) || isNumber(last_char))) </i><br>
        <br>
        Der Vorg&auml;nger einer geschlossenen Klammer kann nur eine weitere geschlossene Klammer oder aber eine Ziffer sein, ist dies nicht der Fall, wird der Ausdruck false.<br>
        &Auml;hnlich wie in diesem Beispiel wird auch bei allen anderen Schritten vorgegangen.<br>
        Die m&ouml;glichen &Uuml;berg&auml;nge k&ouml;nnen der Tabelle entnommen werden.<br>
        Zus&auml;tzlich werden die Klammern mitgez&auml;hlt. Wird eine Klammer ge&ouml;ffnet, wird diese in den Keller geschrieben, wird nun sp&auml;ter wieder eine Klammer geschlossen,
        wird eine Klammer aus dem Keller entfernt. Am Ende muss der Keller genau leer sein. Es kann also weder ein 'X' im Keller verbleiben noch darf versucht werden ein 'X' aus dem Keller zu holen, obwohl dieser bereits leer ist.
    </p>
</div>
</body>
</html>